In [11]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

# Scrape daily case data from Worldometers

In [12]:
import urllib.request
from urllib.request import urlopen
from bs4 import BeautifulSoup
import requests as req

user_agent = 'Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.9.0.7) Gecko/2009021910 Firefox/3.0.7'
headers={'User-Agent':user_agent,}

def scraper(url, selector):
    request=urllib.request.Request(url,None,headers) #The assembled request
    html = urlopen(request)
    soup = BeautifulSoup(html, "html.parser")
    script_divs = soup.find_all('script', {'type': 'text/javascript'})
    res = 0
    for i in range(len(script_divs)):
#         print(i)
#         print(script_divs[i])
        if selector in str(script_divs[i]):
            res = script_divs[i]
            break
#     print(res)
    lst = str(res).split(',')
    lst = [item.strip() for item in lst]
    lst = [test.replace('\n', '').replace('"', '').replace('            ', '') for test in lst]
    return lst

In [13]:
def parseVals(url, country, selector):
    arr = scraper(url,selector)
    start = False
    end = False
    data_start = False
    data_end = False
    for i in range(len(arr)):
        if "xAxis" in arr[i]:
            start = i
        elif "]" in arr[i] and not data_start:
            end = i
        elif "data" in arr[i] and end:
            data_start = i
        elif "]" in arr[i] and data_start:
            data_end = i
            break
        if data_end:
            print("here")
            break
    arr[start] = arr[start].replace("xAxis: {categories: [", '')
    arr[data_start] = arr[data_start].replace("data: [", '')
    arr[end] = arr[end].replace("]        }", '')
    arr[data_end] = arr[data_end].replace("]        }]", '')
    df = pd.DataFrame()
    df["date"] = arr[start:end+1]
    df["value"] = arr[data_start:data_end+1]
    df["country"] = country
    return df

In [14]:
countries = """us
brazil
india
mexico
uk
italy
france
spain
peru
iran
colombia
argentina
russia
south-africa
chile
indonesia
ecuador
belgium
iraq
germany
canada
turkey
bolivia
netherlands
philippines
pakistan
ukraine
romania
egypt
sweden
bangladesh
saudi-arabia
china
poland
guatemala
morocco
panama
honduras
czech-republic
israel
portugal
dominican-republic
algeria
switzerland
ireland
kazakhstan
japan
moldova
hungary
afghanistan
ethiopia
paraguay
costa-rica
armenia
oman
bulgaria
myanmar
kyrgyzstan
nigeria
bosnia-and-herzegovina
austria
belarus
el-salvador
north-macedonia
kenya
australia
tunisia
nepal
sudan
libya
puerto-rico
serbia
venezuela
kuwait
denmark
azerbaijan
kosovo
jordan
yemen
lebanon
greece
uzbekistan
albania
united-arab-emirates
croatia
donetsk-pr
south-korea
palestine
cameroon
finland
zambia
senegal
bahrain
ghana
dr-congo
norway
montenegro
syria
angola
slovenia
madagascar
zimbabwe
georgia
malaysia
haiti
qatar
jamaica
malawi
slovakia
mauritania
nicaragua
luxembourg
lithuania
bahamas
mali
namibia
cuba
ivory-coast
guyana
the-gambia
eswatini
suriname
trinidad-and-tobago
hong-kong
somalia
uganda
chad""".splitlines()
countries

['us',
 'brazil',
 'india',
 'mexico',
 'uk',
 'italy',
 'france',
 'spain',
 'peru',
 'iran',
 'colombia',
 'argentina',
 'russia',
 'south-africa',
 'chile',
 'indonesia',
 'ecuador',
 'belgium',
 'iraq',
 'germany',
 'canada',
 'turkey',
 'bolivia',
 'netherlands',
 'philippines',
 'pakistan',
 'ukraine',
 'romania',
 'egypt',
 'sweden',
 'bangladesh',
 'saudi-arabia',
 'china',
 'poland',
 'guatemala',
 'morocco',
 'panama',
 'honduras',
 'czech-republic',
 'israel',
 'portugal',
 'dominican-republic',
 'algeria',
 'switzerland',
 'ireland',
 'kazakhstan',
 'japan',
 'moldova',
 'hungary',
 'afghanistan',
 'ethiopia',
 'paraguay',
 'costa-rica',
 'armenia',
 'oman',
 'bulgaria',
 'myanmar',
 'kyrgyzstan',
 'nigeria',
 'bosnia-and-herzegovina',
 'austria',
 'belarus',
 'el-salvador',
 'north-macedonia',
 'kenya',
 'australia',
 'tunisia',
 'nepal',
 'sudan',
 'libya',
 'puerto-rico',
 'serbia',
 'venezuela',
 'kuwait',
 'denmark',
 'azerbaijan',
 'kosovo',
 'jordan',
 'yemen',
 'lebanon',
 'greece',
 'uzbekistan',
 'albania',
 'united-arab-emirates',
 'croatia',
 'donetsk-pr',
 'south-korea',
 'palestine',
 'cameroon',
 'finland',
 'zambia',
 'senegal',
 'bahrain',
 'ghana',
 'dr-congo',
 'norway',
 'montenegro',
 'syria',
 'angola',
 'slovenia',
 'madagascar',
 'zimbabwe',
 'georgia',
 'malaysia',
 'haiti',
 'qatar',
 'jamaica',
 'malawi',
 'slovakia',
 'mauritania',
 'nicaragua',
 'luxembourg',
 'lithuania',
 'bahamas',
 'mali',
 'namibia',
 'cuba',
 'ivory-coast',
 'guyana',
 'the-gambia',
 'eswatini',
 'suriname',
 'trinidad-and-tobago',
 'hong-kong',
 'somalia',
 'uganda',
 'chad']

In [15]:
base_url = "https://www.worldometers.info/coronavirus/country/"
dfs = []
for country in countries:
    temp = base_url + country
    dfs.append(parseVals(temp, country, 'graph-cases-daily'))

In [16]:
dfs

[       date     value country
 0    Feb 15      null      us
 1    Feb 16         0      us
 2    Feb 17         0      us
 3    Feb 18         0      us
 4    Feb 19         0      us
 ..      ...       ...     ...
 262  Nov 03     94669      us
 263  Nov 04    108554      us
 264  Nov 05    123718      us
 265  Nov 06    132541      us
 266  Nov 07  124390]}      us

 [267 rows x 3 columns],
        date    value country
 0    Feb 15     null  brazil
 1    Feb 16     null  brazil
 2    Feb 17     null  brazil
 3    Feb 18     null  brazil
 4    Feb 19     null  brazil
 ..      ...      ...     ...
 262  Nov 03    12920  brazil
 263  Nov 04    23815  brazil
 264  Nov 05    23317  brazil
 265  Nov 06    18247  brazil
 266  Nov 07  21056]}  brazil

 [267 rows x 3 columns],
        date    value country
 0    Feb 15     null   india
 1    Feb 16        0   india
 2    Feb 17        0   india
 3    Feb 18        0   india
 4    Feb 19        0   india
 ..      ...      ...     ...
 262  Nov 03    46033   india
 263  Nov 04    50465   india
 264  Nov 05    47622   india
 265  Nov 06    49851   india
 266  Nov 07  46318]}   india

 [267 rows x 3 columns],
        date   value country
 0    Feb 15    null  mexico
 1    Feb 16    null  mexico
 2    Feb 17    null  mexico
 3    Feb 18    null  mexico
 4    Feb 19    null  mexico
 ..      ...     ...     ...
 262  Nov 03    3763  mexico
 263  Nov 04    5250  mexico
 264  Nov 05    5225  mexico
 265  Nov 06    5567  mexico
 266  Nov 07  5931]}  mexico

 [267 rows x 3 columns],
        date    value country
 0    Feb 15     null      uk
 1    Feb 16        0      uk
 2    Feb 17        0      uk
 3    Feb 18        0      uk
 4    Feb 19        0      uk
 ..      ...      ...     ...
 262  Nov 03    20018      uk
 263  Nov 04    25174      uk
 264  Nov 05    24141      uk
 265  Nov 06    23287      uk
 266  Nov 07  24957]}      uk

 [267 rows x 3 columns],
        date    value country
 0    Feb 15     null   italy
 1    Feb 16        0   italy
 2    Feb 17        0   italy
 3    Feb 18        0   italy
 4    Feb 19        0   italy
 ..      ...      ...     ...
 262  Nov 03    28242   italy
 263  Nov 04    30547   italy
 264  Nov 05    34498   italy
 265  Nov 06    37807   italy
 266  Nov 07  39809]}   italy

 [267 rows x 3 columns],
        date    value country
 0    Feb 15     null  france
 1    Feb 16        0  france
 2    Feb 17        0  france
 3    Feb 18        0  france
 4    Feb 19        0  france
 ..      ...      ...     ...
 262  Nov 03    36330  france
 263  Nov 04    40558  france
 264  Nov 05    58046  france
 265  Nov 06    60486  france
 266  Nov 07  86852]}  france

 [267 rows x 3 columns],
        date  value country
 0    Feb 15   null   spain
 1    Feb 16     27   spain
 2    Feb 17     36   spain
 3    Feb 18     29   spain
 4    Feb 19     23   spain
 ..      ...    ...     ...
 262  Nov 03  18669   spain
 263  Nov 04  19937   spain
 264  Nov 05  21908   spain
 265  Nov 06  22516   spain
 266  Nov 07    0]}   spain

 [267 rows x 3 columns],
        date   value country
 0    Feb 15    null    peru
 1    Feb 16    null    peru
 2    Feb 17    null    peru
 3    Feb 18    null    peru
 4    Feb 19    null    peru
 ..      ...     ...     ...
 262  Nov 03    2357    peru
 263  Nov 04    2885    peru
 264  Nov 05    2935    peru
 265  Nov 06    2781    peru
 266  Nov 07  2507]}    peru

 [267 rows x 3 columns],
        date   value country
 0    Feb 15    null    iran
 1    Feb 16    null    iran
 2    Feb 17    null    iran
 3    Feb 18    null    iran
 4    Feb 19    null    iran
 ..      ...     ...     ...
 262  Nov 03    8932    iran
 263  Nov 04    8452    iran
 264  Nov 05    8772    iran
 265  Nov 06    8864    iran
 266  Nov 07  9450]}    iran

 [267 rows x 3 columns],
        date   value   country
 0    Feb 15    null  colombia
 1    Feb 16    null  colombia
 2    Feb 17    null  colombia
 3    Feb 18    null  colombia
 4    Feb 19    null  colombia
 ..      ...     ...       ...
 262  Nov 03    6136  colombia
 263  Nov 04    8692  colombia
 264  Nov 05    9893  colombia
 265  Nov 06    9756  colombia
 266  Nov 07  8714]}  colombia

 [267 rows x 3 columns],
        date   value    country
 0    Feb 15    null  argentina
 1    Feb 16    null  argentina
 2    Feb 17    null  argentina
 3    Feb 18    null  argentina
 4    Feb 19    null  argentina
 ..      ...     ...        ...
 262  Nov 03   12145  argentina
 263  Nov 04   10652  argentina
 264  Nov 05   11100  argentina
 265  Nov 06   11786  argentina
 266  Nov 07  8037]}  argentina

 [267 rows x 3 columns],
        date    value country
 0    Feb 15     null  russia
 1    Feb 16        0  russia
 2    Feb 17        0  russia
 3    Feb 18        0  russia
 4    Feb 19        0  russia
 ..      ...      ...     ...
 262  Nov 03    18648  russia
 263  Nov 04    19768  russia
 264  Nov 05    19404  russia
 265  Nov 06    20582  russia
 266  Nov 07  20396]}  russia

 [267 rows x 3 columns],
        date   value       country
 0    Feb 15    null  south-africa
 1    Feb 16    null  south-africa
 2    Feb 17    null  south-africa
 3    Feb 18    null  south-africa
 4    Feb 19    null  south-africa
 ..      ...     ...           ...
 262  Nov 03    1241  south-africa
 263  Nov 04    1712  south-africa
 264  Nov 05    1866  south-africa
 265  Nov 06    1761  south-africa
 266  Nov 07  1731]}  south-africa

 [267 rows x 3 columns],
        date   value country
 0    Feb 15    null   chile
 1    Feb 16    null   chile
 2    Feb 17    null   chile
 3    Feb 18    null   chile
 4    Feb 19    null   chile
 ..      ...     ...     ...
 262  Nov 03    1014   chile
 263  Nov 04     840   chile
 264  Nov 05    1540   chile
 265  Nov 06    1827   chile
 266  Nov 07  1568]}   chile

 [267 rows x 3 columns],
        date   value    country
 0    Feb 15    null  indonesia
 1    Feb 16    null  indonesia
 2    Feb 17    null  indonesia
 3    Feb 18    null  indonesia
 4    Feb 19    null  indonesia
 ..      ...     ...        ...
 262  Nov 03    2973  indonesia
 263  Nov 04    3356  indonesia
 264  Nov 05    4065  indonesia
 265  Nov 06    3778  indonesia
 266  Nov 07  4262]}  indonesia

 [267 rows x 3 columns],
        date  value  country
 0    Feb 15   null  ecuador
 1    Feb 16   null  ecuador
 2    Feb 17   null  ecuador
 3    Feb 18   null  ecuador
 4    Feb 19   null  ecuador
 ..      ...    ...      ...
 262  Nov 03    548  ecuador
 263  Nov 04   1323  ecuador
 264  Nov 05    350  ecuador
 265  Nov 06    725  ecuador
 266  Nov 07  978]}  ecuador

 [267 rows x 3 columns],
        date   value  country
 0    Feb 15    null  belgium
 1    Feb 16       0  belgium
 2    Feb 17       0  belgium
 3    Feb 18       0  belgium
 4    Feb 19       0  belgium
 ..      ...     ...      ...
 262  Nov 03    6337  belgium
 263  Nov 04    5955  belgium
 264  Nov 05   14903  belgium
 265  Nov 06   11128  belgium
 266  Nov 07  8703]}  belgium

 [267 rows x 3 columns],
        date   value country
 0    Feb 15    null    iraq
 1    Feb 16    null    iraq
 2    Feb 17    null    iraq
 3    Feb 18    null    iraq
 4    Feb 19    null    iraq
 ..      ...     ...     ...
 262  Nov 03    3595    iraq
 263  Nov 04    3574    iraq
 264  Nov 05    3701    iraq
 265  Nov 06    3568    iraq
 266  Nov 07  2880]}    iraq

 [267 rows x 3 columns],
        date    value  country
 0    Feb 15     null  germany
 1    Feb 16        0  germany
 2    Feb 17        0  germany
 3    Feb 18        0  germany
 4    Feb 19        0  germany
 ..      ...      ...      ...
 262  Nov 03    16545  germany
 263  Nov 04    20228  germany
 264  Nov 05    21757  germany
 265  Nov 06    22246  germany
 266  Nov 07  17119]}  germany

 [267 rows x 3 columns],
        date   value country
 0    Feb 15    null  canada
 1    Feb 16       0  canada
 2    Feb 17       0  canada
 3    Feb 18       0  canada
 4    Feb 19       0  canada
 ..      ...     ...     ...
 262  Nov 03    4672  canada
 263  Nov 04    2768  canada
 264  Nov 05    3635  canada
 265  Nov 06    4471  canada
 266  Nov 07  4246]}  canada

 [267 rows x 3 columns],
        date   value country
 0    Feb 15    null  turkey
 1    Feb 16    null  turkey
 2    Feb 17    null  turkey
 3    Feb 18    null  turkey
 4    Feb 19    null  turkey
 ..      ...     ...     ...
 262  Nov 03    2343  turkey
 263  Nov 04    2391  turkey
 264  Nov 05    2311  turkey
 265  Nov 06    2436  turkey
 266  Nov 07  2483]}  turkey

 [267 rows x 3 columns],
        date  value  country
 0    Feb 15   null  bolivia
 1    Feb 16   null  bolivia
 2    Feb 17   null  bolivia
 3    Feb 18   null  bolivia
 4    Feb 19   null  bolivia
 ..      ...    ...      ...
 262  Nov 03     34  bolivia
 263  Nov 04     69  bolivia
 264  Nov 05    126  bolivia
 265  Nov 06    139  bolivia
 266  Nov 07  142]}  bolivia

 [267 rows x 3 columns],
        date   value      country
 0    Feb 15    null  netherlands
 1    Feb 16    null  netherlands
 2    Feb 17    null  netherlands
 3    Feb 18    null  netherlands
 4    Feb 19    null  netherlands
 ..      ...     ...          ...
 262  Nov 03    7743  netherlands
 263  Nov 04    7633  netherlands
 264  Nov 05    6965  netherlands
 265  Nov 06    7242  netherlands
 266  Nov 07  6671]}  netherlands

 [267 rows x 3 columns],
        date   value      country
 0    Feb 15    null  philippines
 1    Feb 16       0  philippines
 2    Feb 17       0  philippines
 3    Feb 18       0  philippines
 4    Feb 19       0  philippines
 ..      ...     ...          ...
 262  Nov 03    1761  philippines
 263  Nov 04     981  philippines
 264  Nov 05    1586  philippines
 265  Nov 06    2087  philippines
 266  Nov 07  2149]}  philippines

 [267 rows x 3 columns],
        date   value   country
 0    Feb 15    null  pakistan
 1    Feb 16    null  pakistan
 2    Feb 17    null  pakistan
 3    Feb 18    null  pakistan
 4    Feb 19    null  pakistan
 ..      ...     ...       ...
 262  Nov 03    1167  pakistan
 263  Nov 04    1313  pakistan
 264  Nov 05    1302  pakistan
 265  Nov 06    1376  pakistan
 266  Nov 07  1502]}  pakistan

 [267 rows x 3 columns],
        date    value  country
 0    Feb 15     null  ukraine
 1    Feb 16     null  ukraine
 2    Feb 17     null  ukraine
 3    Feb 18     null  ukraine
 4    Feb 19     null  ukraine
 ..      ...      ...      ...
 262  Nov 03     8899  ukraine
 263  Nov 04     9524  ukraine
 264  Nov 05     9850  ukraine
 265  Nov 06     9721  ukraine
 266  Nov 07  10746]}  ukraine

 [267 rows x 3 columns],
        date   value  country
 0    Feb 15    null  romania
 1    Feb 16    null  romania
 2    Feb 17    null  romania
 3    Feb 18    null  romania
 4    Feb 19    null  romania
 ..      ...     ...      ...
 262  Nov 03    7733  romania
 263  Nov 04    8651  romania
 264  Nov 05    9714  romania
 265  Nov 06   10260  romania
 266  Nov 07  9937]}  romania

 [267 rows x 3 columns],
        date  value country
 0    Feb 15   null   egypt
 1    Feb 16      0   egypt
 2    Feb 17      0   egypt
 3    Feb 18      0   egypt
 4    Feb 19      0   egypt
 ..      ...    ...     ...
 262  Nov 03    197   egypt
 263  Nov 04    207   egypt
 264  Nov 05    201   egypt
 265  Nov 06    224   egypt
 266  Nov 07  208]}   egypt

 [267 rows x 3 columns],
        date value country
 0    Feb 15  null  sweden
 1    Feb 16     0  sweden
 2    Feb 17     0  sweden
 3    Feb 18     0  sweden
 4    Feb 19     0  sweden
 ..      ...   ...     ...
 262  Nov 03  3615  sweden
 263  Nov 04  4497  sweden
 264  Nov 05  3441  sweden
 265  Nov 06     0  sweden
 266  Nov 07   0]}  sweden

 [267 rows x 3 columns],
        date   value     country
 0    Feb 15    null  bangladesh
 1    Feb 16    null  bangladesh
 2    Feb 17    null  bangladesh
 3    Feb 18    null  bangladesh
 4    Feb 19    null  bangladesh
 ..      ...     ...         ...
 262  Nov 03    1659  bangladesh
 263  Nov 04    1517  bangladesh
 264  Nov 05    1842  bangladesh
 265  Nov 06    1469  bangladesh
 266  Nov 07  1289]}  bangladesh

 [267 rows x 3 columns],
        date  value       country
 0    Feb 15   null  saudi-arabia
 1    Feb 16   null  saudi-arabia
 2    Feb 17   null  saudi-arabia
 3    Feb 18   null  saudi-arabia
 4    Feb 19   null  saudi-arabia
 ..      ...    ...           ...
 262  Nov 03    473  saudi-arabia
 263  Nov 04    426  saudi-arabia
 264  Nov 05    450  saudi-arabia
 265  Nov 06    436  saudi-arabia
 266  Nov 07  407]}  saudi-arabia

 [267 rows x 3 columns],
        date value country
 0    Jan 22  null   china
 1    Jan 23   259   china
 2    Jan 24   457   china
 3    Jan 25   688   china
 4    Jan 26   769   china
 ..      ...   ...     ...
 286  Nov 03    49   china
 287  Nov 04    17   china
 288  Nov 05    28   china
 289  Nov 06    36   china
 290  Nov 07  33]}   china

 [291 rows x 3 columns],
        date    value country
 0    Feb 15     null  poland
 1    Feb 16     null  poland
 2    Feb 17     null  poland
 3    Feb 18     null  poland
 4    Feb 19     null  poland
 ..      ...      ...     ...
 262  Nov 03    19364  poland
 263  Nov 04    24692  poland
 264  Nov 05    27143  poland
 265  Nov 06    27086  poland
 266  Nov 07  27875]}  poland

 [267 rows x 3 columns],
        date  value    country
 0    Feb 15   null  guatemala
 1    Feb 16   null  guatemala
 2    Feb 17   null  guatemala
 3    Feb 18   null  guatemala
 4    Feb 19   null  guatemala
 ..      ...    ...        ...
 262  Nov 03    379  guatemala
 263  Nov 04    664  guatemala
 264  Nov 05    702  guatemala
 265  Nov 06    653  guatemala
 266  Nov 07  548]}  guatemala

 [267 rows x 3 columns],
        date   value  country
 0    Feb 15    null  morocco
 1    Feb 16    null  morocco
 2    Feb 17    null  morocco
 3    Feb 18    null  morocco
 4    Feb 19    null  morocco
 ..      ...     ...      ...
 262  Nov 03    4495  morocco
 263  Nov 04    5745  morocco
 264  Nov 05    5641  morocco
 265  Nov 06    5398  morocco
 266  Nov 07  5836]}  morocco

 [267 rows x 3 columns],
        date  value country
 0    Feb 15   null  panama
 1    Feb 16   null  panama
 2    Feb 17   null  panama
 3    Feb 18   null  panama
 4    Feb 19   null  panama
 ..      ...    ...     ...
 262  Nov 03    677  panama
 263  Nov 04    432  panama
 264  Nov 05    543  panama
 265  Nov 06   1193  panama
 266  Nov 07  746]}  panama

 [267 rows x 3 columns],
        date  value   country
 0    Feb 15   null  honduras
 1    Feb 16   null  honduras
 2    Feb 17   null  honduras
 3    Feb 18   null  honduras
 4    Feb 19   null  honduras
 ..      ...    ...       ...
 262  Nov 03    193  honduras
 263  Nov 04    283  honduras
 264  Nov 05    436  honduras
 265  Nov 06    223  honduras
 266  Nov 07  229]}  honduras

 [267 rows x 3 columns],
        date   value         country
 0    Feb 15    null  czech-republic
 1    Feb 16    null  czech-republic
 2    Feb 17    null  czech-republic
 3    Feb 18    null  czech-republic
 4    Feb 19    null  czech-republic
 ..      ...     ...             ...
 262  Nov 03   12089  czech-republic
 263  Nov 04   15731  czech-republic
 264  Nov 05   13229  czech-republic
 265  Nov 06   11552  czech-republic
 266  Nov 07  7723]}  czech-republic

 [267 rows x 3 columns],
        date  value country
 0    Feb 15   null  israel
 1    Feb 16   null  israel
 2    Feb 17   null  israel
 3    Feb 18   null  israel
 4    Feb 19   null  israel
 ..      ...    ...     ...
 262  Nov 03    892  israel
 263  Nov 04    804  israel
 264  Nov 05    531  israel
 265  Nov 06    539  israel
 266  Nov 07  547]}  israel

 [267 rows x 3 columns],
        date   value   country
 0    Feb 15    null  portugal
 1    Feb 16    null  portugal
 2    Feb 17    null  portugal
 3    Feb 18    null  portugal
 4    Feb 19    null  portugal
 ..      ...     ...       ...
 262  Nov 03    2596  portugal
 263  Nov 04    7497  portugal
 264  Nov 05    4410  portugal
 265  Nov 06    5550  portugal
 266  Nov 07  6640]}  portugal

 [267 rows x 3 columns],
        date  value             country
 0    Feb 15   null  dominican-republic
 1    Feb 16   null  dominican-republic
 2    Feb 17   null  dominican-republic
 3    Feb 18   null  dominican-republic
 4    Feb 19   null  dominican-republic
 ..      ...    ...                 ...
 262  Nov 03    257  dominican-republic
 263  Nov 04    430  dominican-republic
 264  Nov 05    546  dominican-republic
 265  Nov 06    476  dominican-republic
 266  Nov 07  345]}  dominican-republic

 [267 rows x 3 columns],
        date  value  country
 0    Feb 15   null  algeria
 1    Feb 16   null  algeria
 2    Feb 17   null  algeria
 3    Feb 18   null  algeria
 4    Feb 19   null  algeria
 ..      ...    ...      ...
 262  Nov 03    405  algeria
 263  Nov 04    548  algeria
 264  Nov 05    642  algeria
 265  Nov 06    631  algeria
 266  Nov 07  581]}  algeria

 [267 rows x 3 columns],
        date  value      country
 0    Feb 15   null  switzerland
 1    Feb 16   null  switzerland
 2    Feb 17   null  switzerland
 3    Feb 18   null  switzerland
 4    Feb 19   null  switzerland
 ..      ...    ...          ...
 262  Nov 03   6126  switzerland
 263  Nov 04  10073  switzerland
 264  Nov 05  10128  switzerland
 265  Nov 06   9409  switzerland
 266  Nov 07    0]}  switzerland

 [267 rows x 3 columns],
        date  value  country
 0    Feb 15   null  ireland
 1    Feb 16      0  ireland
 2    Feb 17      0  ireland
 3    Feb 18      0  ireland
 4    Feb 19      0  ireland
 ..      ...    ...      ...
 262  Nov 03    298  ireland
 263  Nov 04    435  ireland
 264  Nov 05    563  ireland
 265  Nov 06    492  ireland
 266  Nov 07  317]}  ireland

 [267 rows x 3 columns],
        date  value     country
 0    Feb 15   null  kazakhstan
 1    Feb 16      0  kazakhstan
 2    Feb 17      0  kazakhstan
 3    Feb 18      0  kazakhstan
 4    Feb 19      0  kazakhstan
 ..      ...    ...         ...
 262  Nov 03    449  kazakhstan
 263  Nov 04    432  kazakhstan
 264  Nov 05    494  kazakhstan
 265  Nov 06    591  kazakhstan
 266  Nov 07  613]}  kazakhstan

 [267 rows x 3 columns],
        date   value country
 0    Feb 15    null   japan
 1    Feb 16       6   japan
 2    Feb 17       7   japan
 3    Feb 18       8   japan
 4    Feb 19      10   japan
 ..      ...     ...     ...
 262  Nov 03     468   japan
 263  Nov 04     619   japan
 264  Nov 05     938   japan
 265  Nov 06     944   japan
 266  Nov 07  1132]}   japan

 [267 rows x 3 columns],
        date   value  country
 0    Feb 15    null  moldova
 1    Feb 16    null  moldova
 2    Feb 17    null  moldova
 3    Feb 18    null  moldova
 4    Feb 19    null  moldova
 ..      ...     ...      ...
 262  Nov 03     710  moldova
 263  Nov 04    1020  moldova
 264  Nov 05    1059  moldova
 265  Nov 06     935  moldova
 266  Nov 07  1174]}  moldova

 [267 rows x 3 columns],
        date   value  country
 0    Feb 15    null  hungary
 1    Feb 16    null  hungary
 2    Feb 17    null  hungary
 3    Feb 18    null  hungary
 4    Feb 19    null  hungary
 ..      ...     ...      ...
 262  Nov 03    3989  hungary
 263  Nov 04    4219  hungary
 264  Nov 05    3928  hungary
 265  Nov 06    4709  hungary
 266  Nov 07  5318]}  hungary

 [267 rows x 3 columns],
        date value      country
 0    Feb 15  null  afghanistan
 1    Feb 16  null  afghanistan
 2    Feb 17  null  afghanistan
 3    Feb 18  null  afghanistan
 4    Feb 19  null  afghanistan
 ..      ...   ...          ...
 262  Nov 03    95  afghanistan
 263  Nov 04    86  afghanistan
 264  Nov 05   121  afghanistan
 265  Nov 06    40  afghanistan
 266  Nov 07  58]}  afghanistan

 [267 rows x 3 columns],
        date  value   country
 0    Feb 15   null  ethiopia
 1    Feb 16   null  ethiopia
 2    Feb 17   null  ethiopia
 3    Feb 18   null  ethiopia
 4    Feb 19   null  ethiopia
 ..      ...    ...       ...
 262  Nov 03    560  ethiopia
 263  Nov 04    379  ethiopia
 264  Nov 05    510  ethiopia
 265  Nov 06    355  ethiopia

In [17]:
tempdf = pd.concat(dfs)
tempdf

       date value country
0    Feb 15  null      us
1    Feb 16     0      us
2    Feb 17     0      us
3    Feb 18     0      us
4    Feb 19     0      us
..      ...   ...     ...
262  Nov 03    14    chad
263  Nov 04     4    chad
264  Nov 05    12    chad
265  Nov 06     9    chad
266  Nov 07   5]}    chad

[31273 rows x 3 columns]

# Reformat df into pivot table

In [18]:
pivottable = pd.pivot_table(tempdf, values='value', index=['date'], columns=['country'], aggfunc=sum).fillna(0)
pivottable

country,afghanistan,albania,algeria,angola,argentina,armenia,australia,austria,azerbaijan,bahamas,...,uganda,uk,ukraine,united-arab-emirates,us,uzbekistan,venezuela,yemen,zambia,zimbabwe
date,,,,,,,,,,,,,,,,,,,,,
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Apr 01,63,16,131,1,79,39,285,531,61,7,...,0,3917,149,150,27372,9,9,null,0,0
Apr 02,36,18,139,0,132,92,266,418,41,3,...,1,3845,103,210,30702,24,2,null,3,1
Apr 03,8,27,185,0,88,73,140,395,43,0,...,3,4032,175,240,33080,22,7,null,0,0
Apr 04,28,29,80,2,98,34,96,257,78,4,...,0,3384,153,241,34562,39,2,null,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Sep 26,6,108,160,82,11249,429,16,714,108,91,...,146,7579,3833,1078,43582,427,667,1,97,16
Sep 27,35,106,153,46,8841,328,24,662,128,48,...,166,7713,3130,851,34116,501,751,0,29,9
Sep 28,6,132,146,79,11807,174,4,556,38,0,...,247,4662,2671,626,37394,456,837,1,19,4
Sep 29,21,127,155,108,13477,327,19,609,58,65,...,240,9116,3627,995,44478,578,835,0,55,21
Sep 30,14,131,162,67,14392,458,15,772,110,119,...,112,10157,4027,1100,41212,363,759,3,44,1

In [19]:
pivottable.to_csv("corona_country_daily_v3.csv")